app/views/advertisements/index.html.haml

- if user_signed_in?
  - current_user.advertisements.in_groups_of(3).each do |advertisement_group|
    .row
---
SELECT `advertisements`.* FROM `advertisements` WHERE `advertisements`.`user_id` = 1